TexasInstruments/msp-hal_ti/mspm33/source/ti/driverlib/dl_i2s.h
    return ((DL_I2S_DATA_DELAY)(dataDelay));
}

/**
 *  @brief Set the data pin behavior during empty slots
 *
 *  @param[in] i2s    Pointer to the register overlay for the peripheral
 *  @param[in] output The empty slot output behavior.
 *                    One of @ref DL_I2S_EMPTY_SLOT_OUTPUT
 */
__STATIC_INLINE void DL_I2S_setEmptySlotOutput(
    I2S_Regs *i2s, DL_I2S_EMPTY_SLOT_OUTPUT output)
{
    DL_Common_updateReg(
        &i2s->FMTCFG, (uint32_t) output, I2S_FMTCFG_EMPTYSLOTOUTPUT_MASK);
}

/**
 *  @brief Get the data pin behavior during empty slots
 *
 *  @param[in] i2s Pointer to the register overlay for the peripheral
 *
 *  @return The empty slot output behavior being used
 *
 *  @retval One of @ref DL_I2S_EMPTY_SLOT_OUTPUT
 */
__STATIC_INLINE DL_I2S_EMPTY_SLOT_OUTPUT DL_I2S_getEmptySlotOutput(
    const I2S_Regs *i2s)
{
    uint32_t output = i2s->FMTCFG & I2S_FMTCFG_EMPTYSLOTOUTPUT_MASK;

    return ((DL_I2S_EMPTY_SLOT_OUTPUT)(output));
}

#ifdef DEVICE_HAS_MULTIPLE_DATA_PIN
/**
 *  @brief Set the direction of the data pins
 *
 *  @param[in] i2s               Pointer to the register overlay for the
 *                               peripheral
 *  @param[in] dataPin0Direction Data pin 0 (AD0) direction.
 *                               One of @ref DL_I2S_DATA_PIN_DIRECTION
 *  @param[in] dataPin1Direction Data pin 1 (AD1) direction.
 *                               One of @ref DL_I2S_DATA_PIN_DIRECTION
 */
__STATIC_INLINE void DL_I2S_setDataPinsDirection(I2S_Regs *i2s,
    DL_I2S_DATA_PIN_DIRECTION dataPin0Direction,
    DL_I2S_DATA_PIN_DIRECTION dataPin1Direction)
{
    DL_Common_updateReg(&i2s->DIRCFG,
        ((((uint32_t) dataPin0Direction) << I2S_DIRCFG_AD0_OFS) |
            (((uint32_t) dataPin1Direction) << I2S_DIRCFG_AD1_OFS)),
        (I2S_DIRCFG_AD0_MASK | I2S_DIRCFG_AD1_MASK));
}

#endif
/**
 *  @brief Set the direction of data pin 0
 *
 *  @param[in] i2s       Pointer to the register overlay for the peripheral
 *  @param[in] direction Data pin direction.
 *                       One of @ref DL_I2S_DATA_PIN_DIRECTION
 */
__STATIC_INLINE void DL_I2S_setDataPin0Direction(
    I2S_Regs *i2s, DL_I2S_DATA_PIN_DIRECTION direction)
{
    DL_Common_updateReg(&i2s->DIRCFG,
        ((uint32_t)(direction)) << I2S_DIRCFG_AD0_OFS, I2S_DIRCFG_AD0_MASK);
}

#ifdef DEVICE_HAS_MULTIPLE_DATA_PIN
/**
 *  @brief Set the direction of data pin 1
 *
 *  @param[in] i2s       Pointer to the register overlay for the peripheral
 *  @param[in] direction Data pin direction.
 *                       One of @ref DL_I2S_DATA_PIN_DIRECTION
 */
__STATIC_INLINE void DL_I2S_setDataPin1Direction(
    I2S_Regs *i2s, DL_I2S_DATA_PIN_DIRECTION direction)
{
    DL_Common_updateReg(&i2s->DIRCFG,
        ((uint32_t)(direction)) << I2S_DIRCFG_AD1_OFS, I2S_DIRCFG_AD1_MASK);
}

#endif
/**
 *  @brief Get the direction of data pin 0
 *
 *  @param[in] i2s Pointer to the register overlay for the peripheral
 *
 *  @return Direction of the data pin
 *
 *  @retval One of @ref DL_I2S_DATA_PIN_DIRECTION
 */
__STATIC_INLINE DL_I2S_DATA_PIN_DIRECTION DL_I2S_getDataPin0Direction(
    const I2S_Regs *i2s)
{
    uint32_t direction = i2s->DIRCFG & I2S_DIRCFG_AD0_MASK;

    return ((DL_I2S_DATA_PIN_DIRECTION)(direction >> I2S_DIRCFG_AD0_OFS));
}

#ifdef DEVICE_HAS_MULTIPLE_DATA_PIN
/**
 *  @brief Get the direction of data pin 1
 *
 *  @param[in] i2s Pointer to the register overlay for the peripheral
 *
 *  @return Direction of the data pin
 *
 *  @retval One of @ref DL_I2S_DATA_PIN_DIRECTION
 */
__STATIC_INLINE DL_I2S_DATA_PIN_DIRECTION DL_I2S_getDataPin1Direction(
    const I2S_Regs *i2s)
{
    uint32_t direction = i2s->DIRCFG & I2S_DIRCFG_AD1_MASK;

    return ((DL_I2S_DATA_PIN_DIRECTION)(direction >> I2S_DIRCFG_AD1_OFS));
}

#endif
/**
 *  @brief Set the valid channel mask of data pin 0
 *
 *  @param[in] i2s Pointer to the register overlay for the peripheral
 *  @param[in] channelMask Valid channel mask of the data pin
 */
__STATIC_INLINE void DL_I2S_setDataPin0ChannelMask(
    I2S_Regs *i2s, uint32_t channelMask)
{
    i2s->WMASK0 = channelMask;
}

#ifdef DEVICE_HAS_MULTIPLE_DATA_PIN
/**
 *  @brief Set the valid channel mask of data pin 1
 *
 *  @param[in] i2s Pointer to the register overlay for the peripheral
 *  @param[in] channelMask Valid channel mask of the data pin
 */
__STATIC_INLINE void DL_I2S_setDataPin1ChannelMask(
    I2S_Regs *i2s, uint32_t channelMask)
{
    i2s->WMASK1 = channelMask;
}

#endif
/**
 *  @brief Get the valid channel mask of data pin 0
 *
 *  @param[in] i2s Pointer to the register overlay for the peripheral
 *
 *  @return Valid channel mask of the data pin
 *
 *  @retval The valid channel mask of the data pin with the range [0, 0xFF].
 *          For single-phase mode, each bit represents 1 channel. For
 *          dual-phase mode, only the first 2 LSBs are considered.
 */
__STATIC_INLINE uint32_t DL_I2S_getDataPin0ChannelMask(const I2S_Regs *i2s)
{
    uint32_t channelMask = i2s->WMASK0 & I2S_WMASK0_MASK_MASK;

    return (channelMask);
}

#ifdef DEVICE_HAS_MULTIPLE_DATA_PIN
/**
 *  @brief Get the valid channel mask of data pin 1
 *
 *  @param[in] i2s Pointer to the register overlay for the peripheral
 *
 *  @return Valid channel mask of the data pin
 *
 *  @retval The valid channel mask of the data pin with the range [0, 0xFF].
 *          For single-phase mode, each bit represents 1 channel. For
 *          dual-phase mode, only the first 2 LSBs are considered.
 */
__STATIC_INLINE uint32_t DL_I2S_getDataPin1ChannelMask(const I2S_Regs *i2s)
{
    uint32_t channelMask = i2s->WMASK1 & I2S_WMASK1_MASK_MASK;

    return (channelMask);
}

#endif
/**
 *  @brief      Get TX FIFO threshold level
 *
 *  @param[in]  i2s     Pointer to the register overlay for the peripheral
 *
 *  @return     Indicates at what fill level in the TX FIFO a threshold will be
 *              generated
 *
 *  @retval     One of @ref DL_I2S_TX_FIFO_LEVEL
 */
__STATIC_INLINE DL_I2S_TX_FIFO_LEVEL DL_I2S_getTXFIFOThreshold(
    const I2S_Regs *i2s)
{
    uint32_t level = i2s->IFLS & I2S_IFLS_TXIFLSEL_MASK;

    return (DL_I2S_TX_FIFO_LEVEL)(level);
}

/**
 *  @brief      Set TX FIFO threshold level
 *
 *  @note Randomly changing FIFO levels when FIFO has contents might lead to
 *  unexpected behavior. It is recommended to clear the FIFO before changing
 *  FIFO threshold levels.
 *
 *  @param[in]  i2s     Pointer to the register overlay for the peripheral
 *  @param[in]  level   Indicates at what fill level in the TX FIFO a threshold
 *                      will be generated.
 *                      One of @ref DL_I2S_TX_FIFO_LEVEL.
 *
 *  @sa         DL_I2S_clearTXFIFO
 */
__STATIC_INLINE void DL_I2S_setTXFIFOThreshold(
    I2S_Regs *i2s, DL_I2S_TX_FIFO_LEVEL level)
{
    DL_Common_updateReg(&i2s->IFLS, (uint32_t) level, I2S_IFLS_TXIFLSEL_MASK);
}

/**
 *  @brief      Get RX FIFO threshold level
 *
 *  @param[in]  i2s     Pointer to the register overlay for the peripheral
 *
 *  @return     Indicates at what fill level in the RX FIFO a threshold will be
 *              generated
 *
 *  @retval     One of @ref DL_I2S_RX_FIFO_LEVEL
 */
__STATIC_INLINE DL_I2S_RX_FIFO_LEVEL DL_I2S_getRXFIFOThreshold(
    const I2S_Regs *i2s)
{
    uint32_t level = i2s->IFLS & I2S_IFLS_RXIFLSEL_MASK;

    return (DL_I2S_RX_FIFO_LEVEL)(level);
}

/**
 *  @brief      Set RX FIFO threshold level
 *
 *  @note Randomly changing FIFO levels when FIFO has contents might lead to
 *  unexpected behavior. It is recommended to clear the FIFO before changing
 *  FIFO threshold levels.
 *
 *  @param[in]  i2s     Pointer to the register overlay for the peripheral
 *  @param[in]  level   Indicates at what fill level in the RX FIFO a threshold
 *                      will be generated.
 *                      One of @ref DL_I2S_RX_FIFO_LEVEL.
 *
 *  @sa         DL_I2S_clearRXFIFO
 */
__STATIC_INLINE void DL_I2S_setRXFIFOThreshold(
    I2S_Regs *i2s, DL_I2S_RX_FIFO_LEVEL level)
{
    DL_Common_updateReg(&i2s->IFLS, (uint32_t) level, I2S_IFLS_RXIFLSEL_MASK);
}

/**
 *  @brief      Checks if RX FIFO clear is complete
 *
 *  @param[in]  i2s     Pointer to the register overlay for the peripheral
 *
 *  @return     If RX FIFO clear is complete
 *
 *  @retval     true if RX FIFO clear is complete
 *  @retval     false if RX FIFO clear is complete
 */
__STATIC_INLINE bool DL_I2S_isRXFIFOClearComplete(const I2S_Regs *i2s)
{
    return ((i2s->STAT & I2S_STAT_RXCLR_MASK) == I2S_STAT_RXCLR_SET);
}

/**
 *  @brief      Checks if TX FIFO clear is complete
 *
 *  @param[in]  i2s     Pointer to the register overlay for the peripheral
 *
 *  @return     If TX FIFO clear is complete
 *
 *  @retval     true if TX FIFO clear is complete
 *  @retval     false if TX FIFO clear is complete
 */
__STATIC_INLINE bool DL_I2S_isTXFIFOClearComplete(const I2S_Regs *i2s)
{
    return ((i2s->STAT & I2S_STAT_TXCLR_MASK) == I2S_STAT_TXCLR_SET);
}

/**
 *  @brief      Enable I2S interrupts
 *
 *  @param[in]  i2s            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to enable. Bitwise OR of
 *                             @ref DL_I2S_INTERRUPT.
 */
__STATIC_INLINE void DL_I2S_enableInterrupt(
    I2S_Regs *i2s, uint32_t interruptMask)
{
    i2s->CPU_INT.IMASK |= interruptMask;
}

/**
 *  @brief      Disable I2S interrupts
 *
 *  @param[in]  i2s            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to disable. Bitwise OR of
 *                             @ref DL_I2S_INTERRUPT.
 */
__STATIC_INLINE void DL_I2S_disableInterrupt(
    I2S_Regs *i2s, uint32_t interruptMask)
{
    i2s->CPU_INT.IMASK &= ~(interruptMask);
}

/**
 *  @brief      Check which I2S interrupts are enabled
 *
 *  @param[in]  i2s            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_I2S_INTERRUPT.
 *
 *  @return     Which of the requested I2S interrupts are enabled
 *
 *  @retval     Bitwise OR of @ref DL_I2S_INTERRUPT values
 */
__STATIC_INLINE uint32_t DL_I2S_getEnabledInterrupts(
    const I2S_Regs *i2s, uint32_t interruptMask)
{
    return (i2s->CPU_INT.IMASK & interruptMask);
}

/**
 *  @brief      Check interrupt flag of enabled I2S interrupts
 *
 *  Checks if any of the I2S interrupts that were previously enabled are
 *  pending.
 *
 *  @param[in]  i2s            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_I2S_INTERRUPT.
 *
 *  @return     Which of the requested I2S interrupts are pending
 *
 *  @retval     Bitwise OR of @ref DL_I2S_INTERRUPT values
 *
 *  @sa         DL_I2S_enableInterrupt
 */
__STATIC_INLINE uint32_t DL_I2S_getEnabledInterruptStatus(
    const I2S_Regs *i2s, uint32_t interruptMask)
{
    return (i2s->CPU_INT.MIS & interruptMask);
}

/**
 *  @brief      Check interrupt flag of any I2S interrupt
 *
 *  Checks if any of the I2S interrupts are pending. Interrupts do not have to
 *  be previously enabled.
 *
 *  @param[in]  i2s            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_I2S_INTERRUPT.
 *
 *  @return     Which of the requested I2S interrupts are pending
 *
 *  @retval     Bitwise OR of @ref DL_I2S_INTERRUPT values
 */
__STATIC_INLINE uint32_t DL_I2S_getRawInterruptStatus(
    const I2S_Regs *i2s, uint32_t interruptMask)
{
    return (i2s->CPU_INT.RIS & interruptMask);
}

/**
 *  @brief      Get highest priority pending I2S interrupt
 *
 *  Checks if any of the I2S interrupts are pending. Interrupts do not have to
 *  be previously enabled.
 *
 *  @param[in]  i2s  Pointer to the register overlay for the peripheral
 *
 *  @return     The highest priority pending I2S interrupt
 *
 *  @retval     One of @ref DL_I2S_IIDX
 */
__STATIC_INLINE DL_I2S_IIDX DL_I2S_getPendingInterrupt(const I2S_Regs *i2s)
{
    return ((DL_I2S_IIDX) i2s->CPU_INT.IIDX);
}

/**
 *  @brief      Clear pending I2S interrupts
 *
 *  @param[in]  i2s            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to clear. Bitwise OR of
 *                             @ref DL_I2S_INTERRUPT.
 */
__STATIC_INLINE void DL_I2S_clearInterruptStatus(
    I2S_Regs *i2s, uint32_t interruptMask)
{
    i2s->CPU_INT.ICLR = interruptMask;
}

/**
 *  @brief Enables I2S interrupt for triggering the DMA receive event
 *
 * Enables the I2S interrupt to be used as the condition to generate an
 * event to directly trigger the DMA. This API configures the DMA_TRIG_RX
 * register, which is the event publisher used for triggering the DMA to do a
 * receive data transfer.
 *
 * @note Only one interrupt source should be enabled at a time.
 *
 *  @param[in]  i2s        Pointer to the register overlay for the peripheral
 *  @param[in]  interrupt  Interrupt to enable as the trigger condition for
 *                         the DMA. One of @ref DL_I2S_DMA_INTERRUPT.
 */
__STATIC_INLINE void DL_I2S_enableDMAReceiveEvent(
    I2S_Regs *i2s, uint32_t interrupt)
{
    i2s->DMA_TRIG_RX.IMASK = interrupt;
}

/**
 *  @brief Enables I2S interrupt for triggering the DMA transmit event
 *
 * Enables the I2S interrupt to be used as the condition to generate an
 * event to directly trigger the DMA. This API configures the DMA_TRIG_TX
 * register, which is the event publisher used for triggering the DMA to do a
 * transmit data transfer.
 *
 * @note Only one interrupt source should be enabled at a time.
 *
 *  @param[in]  i2s        Pointer to the register overlay for the peripheral
 *  @param[in]  interrupt  Interrupt to enable as the trigger condition for
 *                         the DMA. One of @ref DL_I2S_DMA_INTERRUPT.
 */
__STATIC_INLINE void DL_I2S_enableDMATransmitEvent(
    I2S_Regs *i2s, uint32_t interrupt)
{
    i2s->DMA_TRIG_TX.IMASK = interrupt;
}

/**
 *  @brief Disables I2S interrupt from triggering the DMA receive event
 *
 * Disables the I2S interrupt from being used as the condition to generate an
 * event to directly trigger the DMA. This API configures the DMA_TRIG_RX
 * register, which is the event publisher used for triggering the DMA to do a
 * receive data transfer.
 *
 *  @param[in]  i2s        Pointer to the register overlay for the peripheral
 *  @param[in]  interrupt  Interrupt to disable as the trigger condition for
 *                         the DMA. One of @ref DL_I2S_DMA_INTERRUPT.
 */
__STATIC_INLINE void DL_I2S_disableDMAReceiveEvent(
    I2S_Regs *i2s, uint32_t interrupt)
{
    i2s->DMA_TRIG_RX.IMASK &= ~(interrupt);
}

/**
 *  @brief Disables I2S interrupt from triggering the DMA transmit event
 *
 * Disables the I2S interrupt from being used as the condition to generate an
 * event to directly trigger the DMA. This API configures the DMA_TRIG_TX
 * register, which is the event publisher used for triggering the DMA to do a
 * transmit data transfer.
 *
 *  @param[in]  i2s        Pointer to the register overlay for the peripheral
 *  @param[in]  interrupt  Interrupt to disable as the trigger condition for
 *                         the DMA. One of @ref DL_I2S_DMA_INTERRUPT.
 */
__STATIC_INLINE void DL_I2S_disableDMATransmitEvent(
    I2S_Regs *i2s, uint32_t interrupt)
{
    i2s->DMA_TRIG_TX.IMASK &= ~(interrupt);
}

/**
 *  @brief Check which I2S interrupt for DMA receive events is enabled
 *
 *  This API checks the DMA_TRIG_RX register, which is used for triggering the
 *  DMA to do a receive data transfer.
 *
 *  @param[in]  i2s            Pointer to the register overlay for the peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_I2S_DMA_INTERRUPT.
 *
 *  @note Only one interrupt source should be enabled at a time.
 *
 *  @return     The requested I2S interrupt status
 *
 *  @retval     One of @ref DL_I2S_DMA_INTERRUPT
 */
__STATIC_INLINE uint32_t DL_I2S_getEnabledDMAReceiveEvent(
    const I2S_Regs *i2s, uint32_t interruptMask)
{
    return (i2s->DMA_TRIG_RX.IMASK & interruptMask);
}

/**
 *  @brief Check which I2S interrupt for DMA transmit events is enabled
 *
 *  This API checks the DMA_TRIG_TX register, which is used for triggering the
 *  DMA to do a transmit data transfer.
 *
 *  @param[in]  i2s            Pointer to the register overlay for the peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_I2S_DMA_INTERRUPT.
 *
 *  @note Only one interrupt source should be enabled at a time.
 *
 *  @return     The requested I2S interrupt status
 *
 *  @retval     One of @ref DL_I2S_DMA_INTERRUPT
 */
__STATIC_INLINE uint32_t DL_I2S_getEnabledDMATransmitEvent(
    const I2S_Regs *i2s, uint32_t interruptMask)
{
    return (i2s->DMA_TRIG_TX.IMASK & interruptMask);
}

/**
 *  @brief Check interrupt flag of enabled I2S interrupt for DMA receive event
 *
 *  Checks if any of the I2S interrupts for the DMA receive event that were
 *  previously enabled are pending.
 *  This API checks the DMA_TRIG_RX register, which is  used for triggering the
 *  DMA to do a receive event.
 *
 *  @param[in]  i2s            Pointer to the register overlay for the peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_I2S_DMA_INTERRUPT.
 *
 *  @note Only one interrupt source should be enabled at a time.
 *
 *  @return     The requested I2S interrupt status
 *
 *  @retval     One of @ref DL_I2S_DMA_INTERRUPT
 *
 *  @sa         DL_I2S_enableDMAReceiveEvent
 */
__STATIC_INLINE uint32_t DL_I2S_getEnabledDMAReceiveEventStatus(
    const I2S_Regs *i2s, uint32_t interruptMask)
{
    return (i2s->DMA_TRIG_RX.MIS & interruptMask);
}

/**
 *  @brief Check interrupt flag of enabled I2S interrupt for DMA transmit event
 *
 *  Checks if any of the I2S interrupts for the DMA transmit event that were
 *  previously enabled are pending.
 *  This API checks the DMA_TRIG_TX register, which is  used for triggering the
 *  DMA to do a transmit event.
 *
 *  @param[in]  i2s            Pointer to the register overlay for the peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_I2S_DMA_INTERRUPT.
 *
 *  @note Only one interrupt source should be enabled at a time.
 *
 *  @return     The requested I2S interrupt status
 *
 *  @retval     One of @ref DL_I2S_DMA_INTERRUPT
 *
 *  @sa         DL_I2S_enableDMATransmitEvent
 */
__STATIC_INLINE uint32_t DL_I2S_getEnabledDMATransmitEventStatus(
    const I2S_Regs *i2s, uint32_t interruptMask)
{
    return (i2s->DMA_TRIG_TX.MIS & interruptMask);
}

/**
 *  @brief Check interrupt flag of any I2S interrupt for DMA receive event
 *
 *  Checks if any of the I2S interrupts for DMA receive event are pending.
 *  Interrupts do not have to be previously enabled.
 *  This API checks the DMA_TRIG_RX register, which is used for triggering the
 *  DMA to do a receive event.
 *
 *  @param[in]  i2s            Pointer to the register overlay for the peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_I2S_DMA_INTERRUPT.
 *
 *  @return     Which of the requested I2S interrupts are pending
 *
 *  @retval     Bitwise OR of @ref DL_I2S_DMA_INTERRUPT values
 */
__STATIC_INLINE uint32_t DL_I2S_getRawDMAReceiveEventStatus(
    const I2S_Regs *i2s, uint32_t interruptMask)
{
    return (i2s->DMA_TRIG_RX.RIS & interruptMask);
}

/**
 *  @brief Check interrupt flag of any I2S interrupt for DMA transmit event
 *
 *  Checks if any of the I2S interrupts for DMA transmit event are pending.
 *  Interrupts do not have to be previously enabled.
 *  This API checks the DMA_TRIG_TX register, which is used for triggering the
 *  DMA to do a transmit event.
 *
 *  @param[in]  i2s            Pointer to the register overlay for the peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_I2S_DMA_INTERRUPT.
 *
 *  @return     Which of the requested I2S interrupts are pending
 *
 *  @retval     Bitwise OR of @ref DL_I2S_DMA_INTERRUPT values
 */
__STATIC_INLINE uint32_t DL_I2S_getRawDMATransmitEventStatus(
    const I2S_Regs *i2s, uint32_t interruptMask)
{
    return (i2s->DMA_TRIG_TX.RIS & interruptMask);
}

/**
 *  @brief      Suspend external communication
 *
 *  Ongoing communication will complete, and further external communications
 *  are stopped. Tranmit line(s) will be driven to idle state, and further
 *  toggles on the receive line(s) will not be processed. Once suspend is
 *  requested, the CPU should poll to ensure that the device has reached idle.
 *  When the device is idle, the transmit FIFO should be flushed, and the
 *  receive FIFO should be drained prior to disabling the module.
 *  After suspending the module, the I2S register configurations are retained.
 *
 *  @param[in]  i2s  Pointer to the register overlay for the peripheral
 *
 *  @sa DL_I2S_disable
 *  @sa DL_I2S_resume
 */
__STATIC_INLINE void DL_I2S_suspend(I2S_Regs *i2s)
{
    DL_Common_updateReg(
        &i2s->FMTCFG, I2S_FMTCFG_SUSPEND_ENABLE, I2S_FMTCFG_SUSPEND_MASK);
}

/**
 *  @brief      Resume functional mode
 *
 *  Functional communication can be resumed by calling this API, and enabling
 *  the module
 *
 *  @param[in]  i2s  Pointer to the register overlay for the peripheral
 *
 *  @sa DL_I2S_enable
 *  @sa DL_I2S_suspend
 */
__STATIC_INLINE void DL_I2S_resume(I2S_Regs *i2s)
{
    DL_Common_updateReg(
        &i2s->FMTCFG, I2S_FMTCFG_SUSPEND_DISABLE, I2S_FMTCFG_SUSPEND_MASK);
}

/**
 *  @brief      Set the clock source for the I2S peripheral
 *
 *  @param[in]  i2s         Pointer to the register overlay for the peripheral
 *
 *  @param[in]  clockSource Source of the clock for I2S.
 *                          One of @ref DL_I2S_CLOCK_SOURCE.
 */
__STATIC_INLINE void DL_I2S_setClockSource(
    I2S_Regs *i2s, DL_I2S_CLOCK_SOURCE clockSource)
{
    i2s->GPRCM.CLKCFG = (I2S_CLKCFG_KEY_UNLOCK | (uint32_t) clockSource);
}

/**
 *  @brief      Get I2S audio clock configuration
 *
 *  @param[in]  i2s     Pointer to the register overlay for the peripheral
 *
 *  @return     The currently configured clock for I2S
 *
 *  @retval     One of @ref DL_I2S_CLOCK_SOURCE
 */
__STATIC_INLINE DL_I2S_CLOCK_SOURCE DL_I2S_getClockSource(const I2S_Regs *i2s)
{
    uint32_t clockSource = i2s->GPRCM.CLKCFG & I2S_CLKCFG_DAICLK_MASK;

    return ((DL_I2S_CLOCK_SOURCE)(clockSource));
}

#ifdef __cplusplus
}
#endif

#endif /* __MSP_HAS_I2S__ */

#endif /* ti_dl_dl_i2s__include */
/** @}*/
